NACA0012BetaSA/0.incompressible/varRefFieldInversion
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "288";
    object      varRefFieldInversion;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
4032
(
(3.155503264310159 -0.7551526254708323 3.471361287593835e-10)
(2.939628077638974 -0.4956696817008768 3.311333591594418e-10)
(2.720868058404724 -0.7890436887159991 3.344492376387409e-10)
(3.015326676351074 -0.4649642931112721 3.626407484019344e-10)
(3.1162041747894 -0.4258268681823671 3.469970525317322e-10)
(3.37984215986821 -0.480869290737069 3.738686584280976e-10)
(1.9259192063798 -0.7298806062234371 3.358127181143192e-10)
(2.408876501210099 -0.4085981986639823 3.513366568180633e-10)
...
)
;

boundaryField
{
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
    wing
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inout
    {
        type            inletOutlet;
        inletValue      uniform (9.961946980917455 0.8715574274765816 0);
        value           nonuniform List<vector> 
126
(
(9.97288744424937 0.7992128558477156 1.47986250575366e-10)
(9.96741727821176 0.7976760456341661 1.194080060566652e-11)
(9.968347973643253 0.798643994979217 -1.161146166659405e-10)
(9.96767412395417 0.7987392228978638 -1.373085031728488e-10)
(9.967404488156614 0.7994699022994598 -1.1237848092901e-10)
(9.967224319984496 0.8000298083763201 -7.256121680748494e-11)
(9.967322535350597 0.8009632080795376 -2.401385134904825e-11)
(9.967614496735781 0.8018340347897952 3.127511846288599e-11)
...
)
;
    }
}


// ************************************************************************* //
